<?php if (!defined('THINK_PATH')) exit();?><link rel="stylesheet" type="text/css" href="../Public/css/developer.css">
<link rel="stylesheet" type="text/css" href="__PUBLIC__/js/autovalidate/style.css" />
<script type='text/javascript' src="__PUBLIC__/js/jquery-1.7.1.min.js"></script>
<script type='text/javascript' src="__PUBLIC__/js/autovalidate/validate.js"></script>
<script type='text/javascript' src="__PUBLIC__/js/artdialog/jquery.artDialog.js?skin=aero"></script>
<script type='text/javascript' src="__PUBLIC__/js/form.js"></script>
<script type='text/javascript' src="__PUBLIC__/js/common.js"></script>
<script type='text/javascript' src="../Public/js/admin.js"></script>
<script type='text/javascript' src="../Public/js/admincommon.js"></script>
<script type='text/javascript' src="../Public/js/menu.js"></script>

<div class="headbar clearfix" style="width:960px; margin:0 auto;">
	<div class="position"><span>开发者管理中心</span><span>></span><span>授权条款</span></div>
	<!--<ul class="tab" name="menu1">
		<li id="li_1" class="selected"><a href="javascript:void(0)" hidefocus="true" onclick="select_tab('1')">商品信息</a></li>
		<li id="li_2"><a href="javascript:void(0)" hidefocus="true" onclick="select_tab('2')">描述</a></li>
		<li id="li_3"><a href="javascript:void(0)" hidefocus="true" onclick="select_tab('3')">营销选项</a></li>
	</ul>-->
</div>
<div class="content_box" style="width:960px; margin:0 auto;">
	<!-- layout::Layout:developerbar::0 -->	
     
	<div class="form_content" style="padding:10px; width:750px; border:1px solid #DDD;">
		<h1 style="margin:20px 0 20px 286px; display:block; color:#53A6D1;">开发者注册条款</h1>
        
1.前言
<p>「N多平台」是一个由上海恩度网络科技有限公司拥有并负责营运的公开网站，其中「N多平台」包含N多平台和N多网以及PC端授权使用，您可以透过合适并兼容之设备将您的产品上传至「N多平台」以供用户免费下载使用 。</p>
<p>「N多平台」开发者注册及上传软件条款（以下简称"本条款"）一经您同意接受后即形成您与上海恩度网络间有法律约束力之文件，您在「N多平台」注册或提供、上传、下载、转载您的产品将受本条款之规范。如果您不同意本条款中之任何一条条款，您将不得参加并使用「N多平台」 。
<p>一旦您接受本条款，您保证您已达法定年龄且具有完全之行为能力，如果您为一个公司，组织或其他法律实体，您保证您的公司或组织是根据您居住地之法律所组成，您声明并保证您的公司或组织已合法授权您代表您的公司或组织加入「N多平台」。</p>
<p>如果您代表您的雇主或其他法律实体同意遵守本条款，您声明并保证您拥有完整合法的权利，可使您的雇主或实体接受本条款之拘束。 如果您并无得到所需之授权，您不得接受本条款或代表您的雇员或其他法律实体加入的「N多平台」。</p><br/>

2. 名词定义
<p>「品牌」是指您或上海恩度网络所拥有之商标名称，商标，服务标记，域名，以及其他特殊的品牌特征。</p>
<p>「产品」是指任何信息或材料，包括但不限于服务，应用程序，数据，文件，软件，音乐，声音，图片，图像，图形，影音讯息，答案，问题，意见，建议，暗示，策略，观念，设计，想法，计划。</p>
<p>「自由软件」是指根据其受权条款目前列在http://opensource.org/licenses或归类于http://www.opensource.org/docs/definition.php之任何公开免费软件资源。</p>
<p>「您」是指登记加入「N多平台」之个人或法人。如果您已经代表您的公司，组织或法人实体接受并同意本条款，那么「您」指的是您的公司，组织或法律实体。</p><br/>
3. 注册或终止您的开发者账号
<p>当您注册会费，您将取得一个永久有效的「N多平台」开发者账号，您并同意提供最新、正确、真实、完整的开发者讯息；且您应保持上述讯息的随时更新。您的注册信息将被用来验证您的开发者账号。如果您不能提供最新，正确，真实，完整的个人开发者讯息，上海恩度网络得拒绝您的注册及终止您参加「N多平台」。上海恩度网络并保留接受或拒绝您的注册之权利。</p>
<p>当您注册时，您应该设立您的用户名称和密码。您应对您的用户名称和密码善尽保管之义务并负完全保管之责任以防遭他人盗用，如您的用户名称和密码遭到盗用时您应及时通知上海恩度网络。上海恩度网络得视实际情况限制对您或您的公司或组织您核发开发者账号之数量。另您不得有任何违法或不当使他人之开发者用户名称或密码之行为。</p>
<p>如果您不想再参加「N多平台」，您得随时终止您的开发者账号，您的开发者账号一但终止后您将无法再登入「N多平台」。另外如您有任何违反或有迹象指出您将违反本条款之规定时；上海恩度网络得终止您的开发者账号或限制您使用某些「N多平台」之功能；另您的开发者账号一经终止，上海恩度网络保留将您的产品将「N多平台」中移除之权利。</p>
<p>如果您的产品由您或上海恩度网络从 「N多平台」移除后，产品之纪录与复制的内容可能仍然保留在「N多平台」和与上海恩度网络之服务器上。</p><br/>
4.开发者权利义务<br/>
4.1 您同意在依据下列规范使用「N多平台」<br/>（1）本条款之规定及<br/>（2）相关有司法管辖权适用之法律，法规或一般惯例或准则。<br/>
4.2 您同意如果您使用「N多平台」发布产品，您会保护用户隐私和与相关合法权益。如果用户于使用您的产品时提供用户名称，密码或其它登录信息或个人信息，您必须提供适当的隐私权通知于用户和保护这些用户的个人资料隐私。此外，用户所提供之讯息仅限于用户同意您可使用之范围内做为您的产品之利用。 如果您的产品储存由用户所提供之个人信息或其它敏感信息时，您必须尽妥善保管信息之义务。<br/>
4.3 您同意不从事任何会侵害「N多平台」之行为，包括在未经授权之下对包含但不限于上海恩度或其他第三方之行动通信网路、设备或资产进行干扰，破坏。您不得将于「N多平台」中所取得之用户信息转售或揭露于任何第三方知悉。<br/>
您同意对用户之个人资料负绝对之保密义务及保管责任，未经用户之事前书面同意，绝不作超出本条款之目的范围之使用或以任何方式将其泄露、告知、交付予任何第三人，若有违反致上海恩度网络或上海恩度网络之客户受有损害，您同意无条件赔偿上海恩度网络所受之一切损害（包括因此所产生之律师费用及诉讼费用），并同意就每一用户对于您个别产品泄露事件之主张另支付上海恩度网络人民币壹佰万元作为惩罚性损害赔偿金，如另涉有民刑事责任，并应负起相关所有民刑事责任。<br/>
4.4 您不得利用「N多平台」以从事促销「N多平台」以外产品之行为。<br/>
4.5 您同意并了解，您对您所上传至「N多平台集」之任何产品及行为（包含上海恩度因此可能所受之损害）负完全之责任 。<br/>
4.6 您同意并了解，您对您违反本条款或任何适用第三方之服务条款，或任何适用法律或法规，以及所造成之损害（包括任何上海恩度或任何第三方可能遭受的损失或损害）应单独负完全之责任。<br/>
4.7 您需负责于上载您的产品至「N多平台」时提供用户所需的产品功能信息及产品安装于用户设备上时所需之安全需知；如果您于上传时未具备上述信息，您的产品将不会于「N多平台」发表。<br/>
4.8 您应保证所提供之产品内容符合以下条件：<br/>
a. 产品内容无侵犯著作权、专利权、商标权、命名权、肖像权或其他第三人的权利等。<br/>
b. 产品内容无任何可能诽谤他人名誉或侵犯第三人隐私权。<br/>
c. 产品内容不含传染性的程序，例如计算机病毒。<br/>
d. 产品内容不含任何可能构成刑事犯罪的事物。<br/>
e. 产品内容不违反公共秩序或善良风俗或无违反之虞者。<br/>
f. 产品内容不违反现行法律、规章或同类的规定，或无违反之虞者。<br/>
5. 相关授权条款<br/>
您所上传之产品所有权归您所有，您于「N多平台」上传之产品时并不代表产品之所有权移转至上海恩度网络；此外您同意并授权上海恩度网络非专属性、全球性、不可撤销性和免授权费之授权以利上海恩度网络进行使用、复制、公开展演、与公开传输。
除本条款另有规定外，相关产品权利之归属各该所有权人所有包括但不限于知识产权、品牌特征…等。
另您授权上海恩度网络及其顾问，供货商和承包商得基于市场营销之目的使用您的产品或品牌特征；但本条款并不授权您可使用上海恩度网络的品牌商标。
您同意并授权透过「N多平台」取得您产品之用户非专属性、全球性之长期使用您的产品；如果用户与您达成其他协议时，相关之规定应依您与用户所达成之协议为准，如有任何纠纷发生应依您与客户所达成之其他协议为准，概与上海恩度网络无关。
6. 产品上传与筛选<br/>
6.1 上传至「N多平台」<br/>
您保证您的产品内容符合本条款之一切规定并配合如实回答及提供一切相关所需之信息，您就可以上传您的产品至「N多平台」，但上海恩度将进行最终审核且决定是否正式上线。<br/>
6.2 产品合适性<br/>
您同意并了解上海恩度网络有权自行判断并决定您的产品是否符合「N多平台」之需求，并拥有决定是否可以上架之权利；另「N多平台」保留随时移除您的产品之权利。
您进一步了解并同意，上海恩度网络并不对您因开发产品、使用「N多平台」或您的产品未能上架销售、被移除或上海恩度网络终止「N多平台」所产生或造成之成本、费用、损害、损失（包括但不限于损失商业机会或利益损失）负责，
您必需确保您的产品于设计或运转是安全且无瑕疵，并符合相关之法律法规；另您应对用户负保固、产品说明及客户支持之责任，您并不会因为您的产品通过测试上架销售而免除您的相关责任与义务。<br/>
6.3产品移除<br/>
您得于随时于「N多平台」上申请移除您的产品且不再进行贩卖，并经由上海恩度网络之确认。但你必须遵守本条款及付款条件之规定内容。您的产品一经您删除且不在「N多平台」上进行销售时并不<br/>（1）影响先前已购买您的产品用户对于您的产品之使用或授权，（2）将您的产品自「N多平台」或用户先前于「N多平台」购买且已下载并安装于用户之设备中移除，或<br/>（3）改变您对先前已购买之用户提供产品支持或交付之义务。
若收到您的申请通知或是有下列任何情形，上海恩度网络得随时移除您的产品或对您的产品重新分类：<br/>（1）侵害第三人之知识产权或其他权利；（2）违反相关法律法规之规定；<br/>（3）内容包含色情、令人厌恶的内容或其他违反「N多平台」相关政策之情事；<br/>（4）不当销售;<br/>（5）可能使上海恩度网络负有责任；<br/>（6）内容包含病毒或被认定为恶意软件，间谍软件或会对上海恩度网络网络有不利影响；<br/>（7）违反本条款；或<br/>（8）对上海恩度网络之服务器正常运作有不利影响者。 上海恩度网络得依其单独判断而暂停或禁止任一开发者于N多平台之权限。<br/>
倘若您的内容是因为有瑕疵的或为恶意软件而遭非自愿性移除时，上海恩度网络得采取下向您收取因移除有瑕疵的或为恶意软件之所生费用。<br/>
7. 「N多平台」改善计划<br/>
上海恩度网络保留对「N多平台」随时进行改善、除错之权利。您同意并了解「N多平台」于维修期间或其他时间无法正常运作。
另上海恩度网络保留随时终止「N多平台」或部份功能暂停使用之权利， 在这种情况下，您将获得事先通知。
8. 保密义务<br/>
您可以提供对于有关「N多平台」之任何想法、意见或信息，您并同意上海恩度网络得无偿使用您所提供之意见以做为对「N多平台」之改进参考。您同意了解上海恩度网络根据本条款所揭露之相关「N多平台」及上海恩度网络产品所有之营运的信息包含设计、商业计划、商业机会、财务数据、研究成果，开发成果，know-how或其它第三方之机密信息将被视为并统称为 「机密信息」；但下列之信息除外<br/>（1）上海恩度网络已对大众公开;<br/>（2）该等信息您可以证明在上海恩度网络向您揭露前您已合法取得;<br/>（3）由您自己独立开发且未使用任何机密信息或<br/>（4）您透过第三方合法取得且第三方亦经合法管道透过上海恩度网络取得 。<br/>
您同意不对任何第三人披露、发布本条所称之"机密信息"，您并进一步同意采取合理之预防措施以防止任何未经授权的使用，披露，出版，或传播"机密信息"。
您同意在未经上海恩度网络书面同意之前，您不得基于您个人或任何第三人之利益使用「机密信息」，并且上海恩度网络对您因参加「N多平台」所提供的信息不负保密之义务。
您同意并了解上海恩度网络将可能与其他程序开发者合作开发属于上海恩度网络自有之产品，且这些产品可能现在或未来会与您的产品类似。
对于您因签署本条款、使用「N多平台」而所提供任何信息，包括但不限于您产品内的信息，您所赋予上海恩度网络之任何保密义务或使用限制，不论明示或暗示，上海恩度网络全部不予同意。
9. 隐私和信息<br/>
您同意并了解上海恩度网络为了持续改善「N多平台」将收集一些使用数据，包含但不限于产品、相关设备及「N多平台」之整体使用状况。该等信息之搜集与您的个人资料都将受上海恩度网络隐私权政策之规范。
10. 终止<br/>
10.1 本条款将继续有效，直至终止您或上海恩度网络终止本条款。<br/>
10.2 如果您想终止本条款，您必需于三十日前对上海恩度网络发出书面通知，并立即停止使用 所核发给您之用户账号与密码。<br/>
10.3 上海恩度网络得基于下列之任一情形终止本条款：<br/>（1）您违反了任何本条款的规定；<br/>（2）基于法律或法规之要求；<br/>（3）您于50年内并无任何「N多平台」之活动纪录；<br/>（四）您有申请解散、歇业、声请破产、声请重整、声请清算或被票据交换所公告为拒绝往来户等情事发生时；（v）上海恩度网络决定终止「N多平台」之服务。<br/>
11. 免责声明<br/>
您了解并同意，当您使用「N多平台」和任何相关的软件或服务时，上海恩度网络对于「N多平台」之服务包括但不限于稳定性、可依赖性与合适性，产品是否适用于某一特殊用途、是否侵害他人权利等情形，不作任何明示或默示之担保。对于因使用或无法使用本服务而衍生之任何直接、间接、意外、特别或重大之损坏、利益丧失或业务中断，您必需单方面承担相关之风险。
您同意使用「N多平台」服务系基于您的个人意愿，并同意自负任何风险，包括因为透过本服务下载数据或图片，或自本服务中获得之数据导致您的计算机系统损坏，或是发生任何数据流失等结果。
12. 责任限制<br/>
您同意不论基于任何理由，上海恩度网络对您不就任何直接、间接、附随、特别、衍生或惩罚性之损害负责，包括但不限于：数据灭失之损失，即使上海恩度网络已被告知或知悉有发生之可能亦同。
13. 损害赔偿<br/>
在法律允许之最大限度下，您同意保障上海恩度网络及其董事，职员，雇员及代理商对抗任何所有第三方索赔，诉讼，诉讼或诉讼及任何和所有责任，损害，费用和开支（包括合理的诉讼费用），且这些损失是因您（1）您违反本条款；（2）您所上传至「N多平台」之产品；（3）您侵权或违反任何版权，商标，商业秘密，专利或其他知识产权权利，或诽谤任何个人或侵犯其隐私权；及（4）您没有采取合理措施保护您的用户名称和密码导致被盗用。
14. 条款修正<br/>
上海恩度网络保留随时修改本条款之权利；新修正之条款效力并不溯及已上传「N多平台」之产品。为了您可以继续使用「N多平台」，您必须接受和同意的新修正后之条款；如果您不同意新的条款，您将被暂停或终止使用「N多平台」。<br/>
15. 一般法律条款<br/>
15.1 准据法。<br/>
除非法律适用的禁止或另有规定外，本条款之效力、解释、履行及有关事项，悉依中华人民共和国法令处理。双方均同意如因本合约之事项涉讼时，以双方同意提交被告所在地仲裁委员会仲裁解决。
15.2 权利转让<br/>
您不得未经上海恩度网络书面同意之前擅自将本条款之权利义务转让予他人，任何未经上海恩度网络事前书面同意之转让，将是无效的。
15.3 合约之可分割性<br/>
本条款之条款因任何理由被视为无效、违法或无法执行，不得影响本条款其他条款之效力。
15.4 双方关系<br/>
双方因本条款所成立之关系，不得视为为立约人双方、或其关系企业创设任何合伙、合资、聘雇、或本人与代理人之关系。本条款并非利益第三人契约；您对第三人负有损害赔偿责任者，应自负完全之责任，与上海恩度网络无关。
15.5 通知<br/>
本条款之任何通知应以书面(含电子邮件)形式为之；您同意上海恩度网络得以电子邮件之方式透过您注册成为「N多平台」之开发者时所提供之电子邮件地址，寄送书面通知给您。 您可以更新您注册时所提供的注册数据而变更您的电子邮件地址。
15.6 权利之行使<br/>
您同意并了解，如果上海恩度网络未行使基于本条款所赋予之权利义务，并不视为上海恩度网络正式抛弃此等权利义务，且上海恩度网络仍得行使该等权利。
您同意 "不利于起草者原则"于本条款并不适用。
15.7 出口管制<br/>
您声明并保证，您透过「N多平台」所提供之产品内容完全遵守并符合您所在地区以及国际间相关对出口管制之法律或规定；这些法律或规定之限制包括对出口目的地的限制，使用方法和一般使用用户的限制。
15.8 全部协议<br/>
您同意并了解一旦您同意本条款，将对您及上海恩度网络产生法律拘束力，且您使用「N多平台」之所有行为亦受本条款之规范。本条款生效后将取代先前您与上海恩度网络间之一切共识或协议。<br/>
16. 自由软件<br/>
如果您的产品包括任何自由软件，您保证您遵守所有适用的自由软件授权条款。
		
		
	</div>
</div>