<?php
/**
 +------------------------------------------------------------------------------
 * @description:	应用专题Model
 +------------------------------------------------------------------------------
 * @others:			NULL
 * @file:			AppTopicModel.class.php
 * @author:			zxg
 * @date:			20120420
 +------------------------------------------------------------------------------
 */
class AppTopicModel extends Model
{
	public $_msg = '';  //调试使用返回错误信息
	protected $dbName = '_v2_android';//指定数据库名称
	
	/**
     +----------------------------------------------------------
     * 根据应用id获取应用专题id信息
     +----------------------------------------------------------
     * @access public
     +----------------------------------------------------------
     * @param int $aid 应用id
     +----------------------------------------------------------
     * @return int
     +----------------------------------------------------------
	 * @date:			20120420
     +----------------------------------------------------------
	 * @author:		zxg
     +----------------------------------------------------------
     */
	public function getAppTidByAid($aid)
	{
		$cidRow =  $this->field('topic_id')->where("app_id = {$aid}")->order('topic_id DESC')->find();
		return (int)$cidRow['topic_id'];
	}

	/**
     +----------------------------------------------------------
     * 根据专题id获取多个应用id信息
     +----------------------------------------------------------
     * @access public
     +----------------------------------------------------------
     * @param mixed $cid 单个或多个专题id
     +----------------------------------------------------------
     * @return array
     +----------------------------------------------------------
	 * @date:			20120420
     +----------------------------------------------------------
	 * @author:		zxg
     +----------------------------------------------------------
     */
	public function getAppIdsByTids($tid)
	{
		if(is_array($tid) && !empty($tid))
		{
			$ids = implode(',', $tid);
		}
		else
		{
			$ids = (int) $tid;
		}
		$appIds =  $this->field('app_id')->where("`topic_id` in ( {$ids} )")->findAll();
		if(empty($appIds))
		{
			$this->_msg = '该专题下无应用';
			return false;
		}
		$appIdsArr = array();
		foreach($appIds as $k => $v)
		{
			$appIdsArr[] = $v['app_id'];
		}
		return $appIdsArr;
	}
	
}
?>
