<?php
/**
 +------------------------------------------------------------------------------
 * @description:	总专题Model
 +------------------------------------------------------------------------------
 * @others:			NULL
 * @file:			TopicModel.class.php
 * @author:			zxg
 * @date:			20120420
 +------------------------------------------------------------------------------
 */
class TopicModel extends Model
{
	public $_msg = '';  //调试使用返回错误信息
	protected $dbName = '_v2_android';//指定数据库名称
	/**
     +----------------------------------------------------------
     * 获取所有app专题信息
     +----------------------------------------------------------
     * @access public
     +----------------------------------------------------------
     * @param string $order 排序的字段
     +----------------------------------------------------------
     * @return mixed
     +----------------------------------------------------------
	 * @date:			20120420
     +----------------------------------------------------------
	 * @author:		zxg
     +----------------------------------------------------------
     */	
	//过滤无内容专题，比较耗时
	//select id from _v2_android.am_topic  where visible=1 and id in (select topic_id from am_app_topic where app_id in (select app_id from am_appinfo where app_visible=1));
	public function getTopics($order = '`order` ASC')
	{
		return $this->order ($order)->where("`visible`=1")->findall ();
	}
	/**
     +----------------------------------------------------------
     * 获取所有app专题信息
     +----------------------------------------------------------
     * @access public
     +----------------------------------------------------------
     * @param string $order 排序的字段
     +----------------------------------------------------------
     * @return mixed
     +----------------------------------------------------------
	 * @date:			20120420
     +----------------------------------------------------------
	 * @author:		zxg
     +----------------------------------------------------------
     */	
	public function getTopicList($order = '`order` ASC')
	{
		return $this->field('`id`')->order ($order)->where("`visible`=1")->findall ();
	}
	/**
     +----------------------------------------------------------
     * 根据专题id获取应用当前专题信息
     +----------------------------------------------------------
     * @access public
     +----------------------------------------------------------
     * @param int $tid 专题id
	 * @param string $fields 需要取的字段
     +----------------------------------------------------------
     * @return mixed
     +----------------------------------------------------------
	 * @date:			20120420
     +----------------------------------------------------------
	 * @author:		zxg
     +----------------------------------------------------------
     */
	public function getTopicInfoByTid($tid, $fields = 'id, name, description')
	{
		return $this->field($fields)->where("id = {$tid}")->find();
	}
}
?>
